{
  "announcements": [
    {
      "author": "AQUIL the eagle",
      "date": "10/08/2025",
      "title": "Welcome to CharCrafter!",
      "content": "We are excited to announce the launch of the official CharCrafter website. Stay tuned for all the game's updates!"
    },
    {
      "author": "AQUIL the eagle",
      "date": "14/08/2025",
      "title": "New version of CharCrafter 'Ver1 AlpDev1.1' released!!!",
      "content": "In this new version, time has been added, which passes faster if the player moves."
    },
    {
      "author": "AQUIL the eagle",
      "date": "14/08/2025",
      "title": "New version of CharCrafter 'Ver1 AlpDev1.2' released!!!",
      "content": "In this new version, temperature has been added, which changes according to the season and the tile."
    },
    {
      "author": "AQUIL the eagle",
      "date": "16/08/2025",
      "title": "New version of CharCrafter 'Ver1 AlpDev1.3' released!!!",
      "content": "In this new version, hunger, thirst, and stamina now decrease day by day, move by move. An inventory has also been added, with a starter kit and the option to eat or drink."
    },
    {
      "author": "AQUIL the eagle",
      "date": "17/08/2025",
      "title": "New version of CharCrafter 'Ver1 AlpDev1.4' released!!!",
      "content": "In this new version, each tile now has its own minimap, making the map now 640000 tiles large and making a huge impact on the future of CharCrafter."
    },
    {
      "author": "AQUIL the eagle",
      "date": "21/08/2025",
      "title": "New version of CharCrafter 'Ver1 AlpDev1.5' released!!!",
      "content": "The game will now be shared in a .zip file with the .exe file and the folder containing the files needed to run the .exe (to try to reduce false positives). In this new version, You can now interact with some tiles, especially trees, bushes, and friendly outpost tiles. Fluids such as water sources or quicksand will now slow down the player, thus increasing the game speed."
    },
    {
      "author": "AQUIL the eagle",
      "date": "01/09/2025",
      "title": "New version of CharCrafter 'Ver1 AlpDev1.6' released!!!",
      "content": "In this new version, The crafting menu, caves, and NPCs have been added, and the greeting logic for outpost buildings has been expanded. Now the game will start to be promoted on TIKTOK, on my profile."
    },
    {
      "author": "AQUIL the eagle",
      "date": "04/09/2025",
      "title": "WHERE WAS IT WHEN IT WAS NEEDED??",
      "content": "In this new version ('Ver1 AlpDev1.6.1'), the executable has been replaced by the Python Archive Zip (or simply '.pyz'), making the game now compatible with all PCs with Python installed (Charcrafter uses Python 1.13). Enjoy playing CharCrafter on your OS!!!"
    },
    {
      "author": "AQUIL the eagle",
      "date": "19/10/2025",
      "title": "New versions of CharCrafter 'Ver1 AlpDev1.7' and 'Ver1 AlpDev1.7.1' released!!!",
      "content": "In this new versions, I added fishing, campfire, a Matrix-style transition between the menu and the game world, the second menu option has had the ability to rename and delete files added, arrow and spear weapon logic has been added, animals spawn after a day, and a new inventory for ammo. I suggest to download the newest version, because it resolves a bug from AlpDev 1.7. That's everything and enjoy the game!!!"
    },
    {
      "author": "AQUIL the eagle",
      "date": "08/11/2025",
      "title": "New AlpDev of CharCrafter 'Ver1 AlpDev1.8' released!!!",
      "content": "In this new AlpDev I've finished adding the sanity mechanism and added a player diary, a new command list mechanism, the ability to click any button to make an in-game message disappear, and a game update viewer on the main menu."
    },
    {
      "author": "AQUIL the eagle",
      "date": "09/11/2025",
      "title": "!!!Repository Modification Error!!!",
      "content": "Due to human error, that is mine, AlpDev 1.7.1 no longer exists. Sorry for the inconvenience :'(."
    },
    {
      "author": "AQUIL the eagle",
      "date": "29/11/2025",
      "title": "!!!Problems with the PayPal DONATION PAGE!!!",
      "content": "I'm having some trouble getting my PayPal page and my account to work, so please don't donate for now until I get this resolved. I have already found another replacement for PayPal, and when I can get it replaced by AntDev210, the problem will be solved. Sorry for the inconvenience :'(."
    }
  ]
}




















